#include <iostream>
using namespace std;

int main() {
    int const M = 5, N = 5;

    int matrix[M][N];
    int lichalnik = 1;  // Лічильник для заповнення значень


    for (int i = 0; i < M; ++i) {
        // логічна умова на заповнення рядків вправо або вліво в залежності від парності рядка
        if (i % 2 == 0) {
            for (int j = 0; j < N; ++j) {//якщо елементи йдуть по порядку
                matrix[i][j] = lichalnik++;  // Заповнення елемента матриці і збільшення лічильника
            }
        }
        else {
            for (int j = N - 1; j >= 0; --j) {//якщо елементи йдуть навпаки 
                matrix[i][j] = lichalnik++;  // Заповнення елемента матриці і збільшення лічильника
            }
        }
    }

    // Виведення заповненої матриці
    cout << "Completed matrix\n";
    for (int i = 0; i < M; ++i) {
        for (int j = 0; j < N; ++j) {
            cout << matrix[i][j] << "\t";  // Виведення елемента матриці з вирівнюванням табуляцією
        }
        cout << endl;  // Перехід на новий рядок після виведення рядка матриці
    }

    return 0;
}